app/Controllers/EnlaceController.php

    public function store()
    {
        $mac = strtoupper($this->request->getPost('mac'));

        if (!preg_match('/^([0-9A-F]{2}[:-]){5}([0-9A-F]{2})$/', $mac)) {
            return redirect()->back()->with('error', 'Formato de MAC inválido');
        }

        $dispositivoModel = new DispositivoModel();
        $enlaceModel = new EnlaceModel();

        $dispositivo = $dispositivoModel->where('MAC', $mac)->first();

        if (!$dispositivo) {
            return redirect()->back()->with('error', 'MAC no encontrada');
        }

        $idUsuario = session()->get('id'); // Asegúrate de que esto esté en la sesión al iniciar sesión

        $yaExiste = $enlaceModel
            ->where('id_usuario', $idUsuario)
            ->where('MAC', $mac)
            ->first();
---
SELECT *
FROM `dispositivos`
WHERE `MAC` = '73:F8:FF:6C:67:F1'
 LIMIT 1
SELECT *
FROM `enlace`
WHERE `id_usuario` = '1'
AND `MAC` = '73:F8:FF:6C:67:F1'
 LIMIT 1