app/Controllers/LecturasController.php

    public function guardar() {
        $model = new LecturasGasModel();
        $nivel_gas = $this->request->getPost('nivel_gas');
        $id_lectura = $this->request->getPost('id_placa');  // Obtiene el id de la lectura

        // Verifica si el id de la lectura está disponible
        if (!$id_lectura) {
            return $this->respond(['status' => 'error', 'message' => 'ID de lectura no proporcionado'], 400);
        }

        // Verifica si ya existe una lectura con el id proporcionado
        $lectura = $model->find($id_lectura);

        if ($lectura) {
            // Si ya existe una lectura, actualiza el nivel de gas
            $model->update($id_lectura, ['nivel_gas' => $nivel_gas]);
            return $this->respond(['status' => 'success', 'message' => 'Lectura actualizada']);
        } else {
            // Si no existe una lectura con ese id, crea una nueva
            $data = [
                'nivel_gas' => $nivel_gas,
                'id' => $id_lectura  // Establece el id proporcionado
            ];

            if ($model->insert($data)) {
---
SELECT *
FROM `lecturas_gas`
WHERE `lecturas_gas`.`id` = '1'
UPDATE `lecturas_gas` SET `nivel_gas` = '105'
WHERE `lecturas_gas`.`id` IN ('1')
INSERT INTO `lecturas_gas` (`usuario_id`, `nivel_gas`, `fecha`) VALUES (1, '87', '2024-11-25 21:58:32')