app/Controllers/PerfilController.php

    public function index()
    {
        $session = session();
        $usuarioId = $session->get('id');

        // --- LOGGING PARA DEBUGGING ---
        log_message('debug', 'PerfilController::index() - Estado de la sesión al inicio: ' . json_encode($session->get()));
        log_message('debug', 'PerfilController::index() - Usuario ID de la sesión: ' . ($usuarioId ?? 'null'));
        // --- FIN LOGGING ---

        // Redirigir si el usuario no está logueado
        if (!$usuarioId) {
            log_message('debug', 'PerfilController::index() - Usuario ID no encontrado en sesión, redirigiendo a login.');
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión para acceder a esta página.');
        }

        // Obtener las direcciones MAC enlazadas al usuario actual desde la tabla 'enlace'
        $enlaces = $this->enlaceModel
                        ->select('MAC')
                        ->where('id_usuario', $usuarioId)
                        ->findAll();

        $macs = array_column($enlaces, 'MAC');

        $dispositivosEnlazados = [];
        if (!empty($macs)) {
            $dispositivosEnlazados = $this->dispositivoModel
                                        ->whereIn('MAC', $macs)
                                        ->findAll();
---
SELECT `MAC`
FROM `enlace`
WHERE `id_usuario` = '19'
SELECT *
FROM `dispositivos`
WHERE `MAC` IN ('73:F8:FF:6C:67:F3')