app/Models/LecturasGasModel.php

    public function getLecturasPorMac(string $mac): array
    {
        return $this->db->table($this->table)
            ->where('MAC', $mac)
            ->orderBy('fecha', 'DESC') // Lecturas más recientes primero para la tabla
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lecturas_gas`
WHERE `MAC` = '73:F8:FF:6C:67:F1'
ORDER BY `fecha` DESC

    public function getLecturasPorUsuario(int $id_usuario): array
    {
        return $this->db->table($this->table)
            ->select('lecturas_gas.*, dispositivos.MAC, dispositivos.nombre as dispositivo_nombre, dispositivos.ubicacion as dispositivo_ubicacion')
            ->join('dispositivos', 'lecturas_gas.MAC = dispositivos.MAC', 'left')
            ->join('enlace', 'dispositivos.MAC = enlace.MAC', 'inner')
            ->where('enlace.id_usuario', $id_usuario)
            ->where('lecturas_gas.MAC IS NOT NULL')
            ->orderBy('lecturas_gas.fecha', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `lecturas_gas`.*, `dispositivos`.`MAC`
FROM `lecturas_gas`
JOIN `dispositivos` ON `lecturas_gas`.`MAC` = `dispositivos`.`MAC`
JOIN `enlace` ON `dispositivos`.`MAC` = `enlace`.`MAC`
WHERE `enlace`.`id_usuario` = '19'
AND `lecturas_gas`.`MAC` IS NOT NULL
ORDER BY `lecturas_gas`.`fecha` DESC