ASG-master/app/Controllers/Home.php

SELECT *
FROM `lecturas_gas`
WHERE `usuario_id` = '1'
ORDER BY `id` DESC
 LIMIT 1
---
    public function login()
{
    $session = session();
    $userlogin = new Userlogin();
    $lecturasGasModel = new \App\Models\LecturasGasModel();

    // Captura los datos enviados desde el formulario
    $nombre = $this->request->getPost('nombre');
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // Buscar el usuario en la base de datos
    $user = $userlogin->where('nombre', $nombre)
                      ->where('email', $email)
                      ->first();

// Verificar si el usuario existe y si la contraseña es correcta
if ($user) {
    if (password_verify($password, $user['password'])) {
        // Obtener la última lectura de gas y la fecha asociada
        $ultimaLectura = $lecturasGasModel->orderBy('id', 'DESC')->where(['usuario_id' => $user['id']])->first();